# SetInsertLocComp

## Description
Sets the insert location component of the object.

```pascal
PROCEDURE SetInsertLocComp(
				object         : HANDLE;
				componentIndex : INTEGER);
```

```python

def vs.SetInsertLocComp(object, componentIndex):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|object|HANDLE|The object. Can be a wall, Wall Style, or the Wall Preferences.|
|componentIndex|INTEGER|The index of the insert location component.|

## See Also
VS Functions:
GetInsertLocComp

## Version
Availability: from Vectorworks 2023
## Category
* Objects - Architectural